"""
Сформировать одномерный список целых чисел A, используя генератор случайных чисел (диапазон от 0 до 99).
Размер списка n ввести с клавиатуры. В соответствии со своим вариантом написать программу по условию,
представленному в таблице ниже.
Вариант 14.
Найти индексы первого и последнего нулевых элементов списка.
"""
import random
# Не указано кол-во эл-тов списка, поэтому буду рандомное кол-во использовать
razmer_spiska = random.randint(1, 99)
sp = []
kolvonul = 0 #счетчик нулевых элементов
for i in range(razmer_spiska):
    sp.append(random.randint(0, 99))
    if sp[i] == 0:
        kolvonul += 1

print(f"Наш рандомый список с {razmer_spiska} элементами:\n", *sp)
if kolvonul == 0:
    print("Нулевых элементов в списке нет")
elif kolvonul == 1:
    print("Нулевой элемент в списке один и его индекс:", sp.index(0) + 1)
else:
    print("Количество нулевых элементов:", kolvonul)
    print("Индекс первого нулевого элемента:", sp.index(0) + 1)
    print("Индекс последнего нулевого элемента:", razmer_spiska - sp[::-1].index(0)) # Инвертируем список, и как бы находим
    # первый нулевой элемент с конца списка. Затем от кол-ва эл-тов списка отнимаем индекс первого нулевого с конца
    # и получаем индекс с начала списка
